CREATE TABLE public.score (
    id integer NOT NULL,
    lecturer_fname text,
    lecturer_lname text,
    lecturer_account text,
    pid text,
    sub_code text,
    sub_name text,
    sub_sect text,
    cmuitaccount text,
    student_id text,
    firstname_th text,
    lastname_th text,
    organization_name_th text,
    score1 numeric,
    score2 numeric,
    score3 numeric,
    score4 numeric,
    score5 numeric,
    score6 numeric,
    dt timestamp without time zone
);


ALTER TABLE public.score OWNER TO postgres;

--
-- TOC entry 200 (class 1259 OID 323319)
-- Name: score_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.score_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.score_id_seq OWNER TO postgres;

--
-- TOC entry 2994 (class 0 OID 0)
-- Dependencies: 200
-- Name: score_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.score_id_seq OWNED BY public.score.id;


--
-- TOC entry 2856 (class 2604 OID 323324)
-- Name: score id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.score ALTER COLUMN id SET DEFAULT nextval('public.score_id_seq'::regclass);


--
-- TOC entry 2988 (class 0 OID 323321)
-- Dependencies: 201
-- Data for Name: score; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.score (id, lecturer_fname, lecturer_lname, lecturer_account, pid, sub_code, sub_name, sub_sect, cmuitaccount, student_id, firstname_th, lastname_th, organization_name_th, score1, score2, score3, score4, score5, score6, dt) FROM stdin;
108	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	631610333	รัติภูมิ	เจริญหมั้น	\N	0	0	5	5	12.86	22.86	2023-02-03 17:14:08.369749
109	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	620510286	พงศ์ภัค	ลังกาพินธุ์	\N	5	5	5	0	20.57	35.57	2023-02-03 17:14:08.369587
110	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	631610340	วรทัต	ไชยวงค์	\N	5	5	5	5	19.29	39.29	2023-02-03 17:14:08.372576
111	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	631610362	วิลาสินี	มนูศิลป์	\N	5	5	5	5	21.43	41.43	2023-02-03 17:14:08.372908
112	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	631610432	อรรถพงศ์	แสงบุญเรือง	\N	5	5	5	5	18	38	2023-02-03 17:14:08.373348
113	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110112	กชกร	อินทรศร	\N	5	5	5	5	17.14	37.14	2023-02-03 17:14:08.37356
114	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110113	กฤตติกา	ทองประเสริฐ	\N	5	5	5	5	10.71	30.71	2023-02-03 17:14:08.373915
116	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110115	กฤษฎาวุฒิ	โทนหงส์ษา	\N	5	5	5	5	13.71	33.71	2023-02-03 17:14:08.374191
117	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110121	กุลธิดา	มูลศรี	\N	5	5	5	4	15	34	2023-02-03 17:14:08.374551
115	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	620510666	สหัสวุฒิ	วุฒิ	\N	5	0	0	0	19.71	24.71	2023-02-03 17:14:08.373239
118	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110123	ขนิษฐา	ในหลวง	\N	5	5	5	5	18	38	2023-02-03 17:14:08.374801
119	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110131	ชงคม	ราชวังเมือง	\N	5	0	5	0	18.43	28.43	2023-02-03 17:14:08.375293
120	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110133	ชนกชนม์	เดือนจันทร์	\N	5	5	5	5	12	32	2023-02-03 17:14:08.375534
121	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110136	โซญ่า	เมียร์	\N	5	5	5	5	20.57	40.57	2023-02-03 17:14:08.375853
123	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110138	ฐิชากร	วงศ์พลาย	\N	5	0	0	5	13.71	23.71	2023-02-03 17:14:08.376205
122	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	620510295	ภัทรพล	สร้อยสนธิ์	\N	5	5	5	5	20.14	40.14	2023-02-03 17:14:08.375167
124	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110140	ณรัชช์อร	ปัญญา	\N	5	5	5	5	18.86	38.86	2023-02-03 17:14:08.376656
125	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110141	ณัฏฐกร	กุลดี	\N	5	5	5	5	17.14	37.14	2023-02-03 17:14:08.376901
126	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110142	ณัฏฐ์วรา	เมืองขวา	\N	5	5	5	5	15.86	35.86	2023-02-03 17:14:08.377265
127	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110145	ณัฐธิดา	พยัคศักดิ์	\N	5	5	5	5	23.14	43.14	2023-02-03 17:14:08.377574
128	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110147	ณัฐวุฒิ	บุญมา	\N	5	5	5	5	15.43	35.43	2023-02-03 17:14:08.380072
129	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110148	ดารณี	โป้สมบุญ	\N	5	5	5	5	17.57	37.57	2023-02-03 17:14:08.38033
130	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110149	ดุลยวิทย์	ยอดแก้ว	\N	5	5	5	5	17.14	37.14	2023-02-03 17:14:08.380628
131	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110155	ธนภูมิ	เป็กธนู	\N	5	5	5	5	18.86	38.86	2023-02-03 17:14:08.381117
132	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110156	ธนวรรษ	แก้วอินทร	\N	5	5	5	5	15	35	2023-02-03 17:14:08.381476
133	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110159	ธัญญาเรศ	แสงศรีจันทร์	\N	5	5	5	5	23.57	43.57	2023-02-03 17:14:08.381909
134	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110160	ธัญพิสิษฐ์	ปัญญาสม	\N	5	5	5	5	15.43	35.43	2023-02-03 17:14:08.382239
135	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110161	ธัญลักษณ์	กาวิละ	\N	5	5	5	5	12.43	32.43	2023-02-03 17:14:08.382698
140	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110167	นภัสวรรณ	สดากร	\N	5	5	5	5	20.14	40.14	2023-02-03 17:14:08.38767
147	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110187	พิทยาภรณ์	ฟูใจ	\N	4	5	5	5	11.14	30.14	2023-02-03 17:14:08.394759
155	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110198	เมทินี	บุญเผือก	\N	5	5	0	5	19.29	34.29	2023-02-03 17:14:08.396476
166	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110225	เสฐียรวุฒิ	สุกิจสุขสวัสดิ์	\N	5	5	5	4	14.14	33.14	2023-02-03 17:14:08.399132
175	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410245	ดาวใจ	ไม่มีนามสกุล	\N	5	5	5	5	18	38	2023-02-03 17:14:08.40097
185	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410268	พิชญวรรณ	เกียรติสยมภู	\N	5	5	5	5	16.71	36.71	2023-02-03 17:14:08.403021
194	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410295	อมรา	ภมรศรีสกุล	\N	5	5	5	4	19.71	38.71	2023-02-03 17:14:08.404905
203	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	651910058	ลัทธพล	ยะกลิ้ง	\N	5	5	5	5	19.29	39.29	2023-02-03 17:14:08.406787
212	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	651910075	โสภณ	เพิงคาม	\N	5	0	0	4	18.86	27.86	2023-02-03 17:14:08.408673
822	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	630510393	นิติพร	ทิพรส	\N	43	12.9	\N	\N	\N	\N	2023-02-17 12:49:39.538184
823	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	630510398	พิชาภพ	มณีเกี๋ยง	\N	49	14.7	\N	\N	\N	\N	2023-02-17 12:49:39.539517
825	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	630510399	เพ็ญจมาศ	ฐานะดี	\N	0	0	\N	\N	\N	\N	2023-02-17 12:49:39.544517
773	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410005	กัลย์สุดา	ทองอ่อน	\N	68	13.6	20	33.6	\N	\N	2023-02-17 12:31:30.869634
776	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410037	นภัสสร	เครือวงค์	\N	77	15.4	20	35.4	\N	\N	2023-02-17 12:31:30.871934
779	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410043	พฤกษา	สุกานนท์	\N	75	15	20	35	\N	\N	2023-02-17 12:31:30.87498
136	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110162	ธันย์ชนก	กลัดเพชร	\N	5	5	5	5	12.86	32.86	2023-02-03 17:14:08.382891
141	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110169	นันท์นภัส	อุ่นบ่อแฮ้ว	\N	5	5	5	5	21	41	2023-02-03 17:14:08.391569
148	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110191	ภัททิยา	ตันฑวณิชย์	\N	5	5	5	5	15	35	2023-02-03 17:14:08.395154
156	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110199	เมธาวี	ใจดี	\N	5	5	5	4	14.57	33.57	2023-02-03 17:14:08.396638
165	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110224	สุภัสสรา	ศรีวรรณ	\N	5	5	5	5	15.43	35.43	2023-02-03 17:14:08.39888
174	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410236	ชุติกาญจน์	ดงพระจันทร์	\N	5	5	5	5	20.57	40.57	2023-02-03 17:14:08.400748
183	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410266	พชรพร	ไชยานนท์	\N	5	5	5	5	21.43	41.43	2023-02-03 17:14:08.402544
184	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410267	พรลภัส	สุขสำราญ	\N	5	0	5	5	16.71	31.71	2023-02-03 17:14:08.402785
193	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410286	ศักดิธัช	เมืองสุวรรณ	\N	5	5	5	5	17.14	37.14	2023-02-03 17:14:08.404699
202	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	651910055	เมธากิตติ์	ทองสุข	\N	4	5	5	5	17.57	36.57	2023-02-03 17:14:08.406574
211	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	651910071	สุพรรษา	เกษการ	\N	5	5	5	5	21	41	2023-02-03 17:14:08.408453
824	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	610510472	ภัทรธิฌา	ชาวชน	\N	50	15	\N	\N	\N	\N	2023-02-17 12:49:39.540366
826	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	630510401	วีรากร	สถาพรพิบูลย์	\N	37	11.1	\N	\N	\N	\N	2023-02-17 12:49:39.544995
827	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	630510406	ชลชาติ	อนุเขตร์	\N	40	12	\N	\N	\N	\N	2023-02-17 12:49:39.548016
829	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	630510407	ชลนิภา	บุญมา	\N	37	11.1	\N	\N	\N	\N	2023-02-17 12:49:39.551098
778	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410011	จุฑามาศ	โชคกิติคุณ	\N	77	15.4	20	35.4	\N	\N	2023-02-17 12:31:30.872215
781	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410049	รัชมา	เสาร์สิงห์	\N	62	12.4	20	32.4	\N	\N	2023-02-17 12:31:30.875544
784	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410056	วรรวรินทร์	สินธุเขียว	\N	73	14.6	7	21.6	\N	\N	2023-02-17 12:31:30.878568
788	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410068	สุกัญญา	สุขเกษม	\N	71	14.2	20	34.2	\N	\N	2023-02-17 12:31:30.881662
792	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410072	สุรบดี	เขียวหน่อเมือง	\N	64	12.8	18	30.8	\N	\N	2023-02-17 12:31:30.884833
137	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110164	ธีรเดช	ทองทวี	\N	5	5	5	5	17.14	37.14	2023-02-03 17:14:08.383333
138	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	631610091	ญาณิศา	ปินตา	\N	5	5	5	5	21.43	41.43	2023-02-03 17:14:08.38366
142	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110171	บัณฑิตา	ศุภจินดา	\N	5	5	5	5	18.43	38.43	2023-02-03 17:14:08.391729
143	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110173	ปณิตา	จารเขียน	\N	5	5	5	5	15	35	2023-02-03 17:14:08.392155
144	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110178	ปุณชิลิญญ์	ทองสุข	\N	0	5	5	4	15	29	2023-02-03 17:14:08.392544
145	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110182	พรปวีณ์	อุดมศรี	\N	5	5	5	5	15	35	2023-02-03 17:14:08.39292
150	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110193	ภาวิตรา	วงค์ไชย	\N	5	5	5	5	15.43	35.43	2023-02-03 17:14:08.395382
153	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110195	ภูษณิศา	เพ็งศิริ	\N	5	5	5	5	23.14	43.14	2023-02-03 17:14:08.395725
158	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110204	วัชรพล	ช่างหล่อ	\N	5	5	0	5	10.71	25.71	2023-02-03 17:14:08.396931
159	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110206	วิภาวี	ผางาม	\N	5	5	5	5	16.71	36.71	2023-02-03 17:14:08.397178
162	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110215	สลิลทิพย์	ออมสิน	\N	5	5	5	5	17.14	37.14	2023-02-03 17:14:08.398022
167	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110227	อดิวิชญ์	ผ่านวิริยะชัย	\N	4	5	5	5	14.57	33.57	2023-02-03 17:14:08.399366
172	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650310133	เพ็ญนภา	รอดประยูร	\N	5	5	5	5	11.14	31.14	2023-02-03 17:14:08.40035
176	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410246	ธนภูมิ	มีกิน	\N	5	5	5	5	18	38	2023-02-03 17:14:08.401165
181	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410264	ปุณยนุช	โชติพานิช	\N	5	5	5	5	21	41	2023-02-03 17:14:08.402148
186	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410270	พิมพิสา	เชียงนวล	\N	5	5	5	5	13.71	33.71	2023-02-03 17:14:08.403231
191	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410282	วัชราภรณ์	โพธิ์วิจิตร	\N	5	0	5	5	16.29	31.29	2023-02-03 17:14:08.404284
195	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410296	อาธิฟ้า	ปุตตะ	\N	5	5	5	5	15	35	2023-02-03 17:14:08.405113
200	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	651910050	ภูดิศ	ทองสุข	\N	4	0	5	5	18	32	2023-02-03 17:14:08.406155
204	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	651910059	วงศธร	ขัดเป็ง	\N	5	5	5	5	18	38	2023-02-03 17:14:08.406991
209	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	651910068	สิรินทรา	ภูมิภักดิ์	\N	5	5	5	5	18.86	38.86	2023-02-03 17:14:08.408048
213	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	590410061	วริสรา	ไชยวงค์	\N	5	5	5	5	38	58	2023-02-03 17:14:08.408896
828	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	620510412	ณัฐวดี	เล็กขำ	\N	67	20.1	\N	\N	\N	\N	2023-02-17 12:49:39.548541
139	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110165	ธีรธัช	พลชนะ	\N	4	5	5	5	17.57	36.57	2023-02-03 17:14:08.385617
146	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110183	พรภิทักษ์	ขัดทา	\N	5	0	5	5	20.57	35.57	2023-02-03 17:14:08.393304
149	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	631610226	ปวีย์นุช	ตุ้ย	\N	5	5	5	5	13.71	33.71	2023-02-03 17:14:08.394638
154	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110196	มณีรัตน์	เลิศรัตนาวรชัย	\N	5	5	5	5	15.86	35.86	2023-02-03 17:14:08.395959
151	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	631610092	ญาณิสา	ดวงไกรแฝง	\N	5	5	5	5	23.57	43.57	2023-02-03 17:14:08.39498
152	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	631610234	ปาณิสรา	คำจำปา	\N	5	5	5	5	24	44	2023-02-03 17:14:08.395053
157	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	631610250	พงศ์ภัค	ปรักมาศ	\N	5	5	5	5	13.29	33.29	2023-02-03 17:14:08.396356
160	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110208	วิรัลพัชร	ตาตุ	\N	5	5	5	5	15.86	35.86	2023-02-03 17:14:08.397533
161	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110209	วุฒิชัย	หอมนานา	\N	5	5	5	4	17.57	36.57	2023-02-03 17:14:08.397777
163	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110217	สิรภพ	เอ้งฉ้วน	\N	5	5	5	5	19.29	39.29	2023-02-03 17:14:08.398188
164	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110222	สุพาภรณ์	บุตรพรม	\N	4	5	5	5	17.57	36.57	2023-02-03 17:14:08.398526
168	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110232	อัยการ	คำปันนา	\N	5	0	5	5	9.43	24.43	2023-02-03 17:14:08.39955
169	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	632110359	อริญรดา	สุขแก้ว	\N	5	5	5	5	15.43	35.43	2023-02-03 17:14:08.399745
170	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	640210379	อัจฉริยา	อุปกาละ	\N	5	5	5	5	23.14	43.14	2023-02-03 17:14:08.399949
171	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650310126	นันทิกานต์	เมฆยิ้ม	\N	5	5	5	5	21.43	41.43	2023-02-03 17:14:08.400152
173	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650310139	ลัคนา	อินกันยา	\N	5	5	5	5	15.43	35.43	2023-02-03 17:14:08.400549
177	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410247	ธวัลรัตน์	กังตระกูล	\N	5	5	5	5	22.71	42.71	2023-02-03 17:14:08.40135
178	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410253	นวินดา	ขาวดำ	\N	5	5	5	5	19.29	39.29	2023-02-03 17:14:08.401554
179	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410261	ปริยากร	จันทร์กระจ่าง	\N	5	5	5	5	18.86	38.86	2023-02-03 17:14:08.401754
180	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410263	ปาณิสรา	ขาวหล้า	\N	5	5	5	5	14.57	34.57	2023-02-03 17:14:08.401945
182	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410265	ปุณยภัทร	วงษ์มูล	\N	5	5	5	5	18.43	38.43	2023-02-03 17:14:08.402349
187	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410271	ภัทริกา	เมืองมาหล้า	\N	5	5	5	5	18.43	38.43	2023-02-03 17:14:08.403445
188	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410273	ภูมิ	ตุลย์วัฒนางกูร	\N	0	5	0	0	19.29	24.29	2023-02-03 17:14:08.403661
189	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410274	ภูริช	ภูมิพาณิชย์	\N	0	5	5	5	18.43	33.43	2023-02-03 17:14:08.403863
190	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410280	รุสลัน	อินทชัย	\N	0	5	5	5	12.86	27.86	2023-02-03 17:14:08.404075
192	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410283	วันวิสาข์	ค้าหวาย	\N	5	5	5	5	12.43	32.43	2023-02-03 17:14:08.404485
196	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	650410297	อินทิรา	วิญญาปา	\N	5	5	5	5	18.86	38.86	2023-02-03 17:14:08.405322
197	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	651910042	พิชญา	ใสสม	\N	5	5	5	5	22.71	42.71	2023-02-03 17:14:08.405529
206	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	651910062	วีรภัทร	พรมเสน	\N	5	0	5	5	21.86	36.86	2023-02-03 17:14:08.407411
830	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	620510448	สุวนันท์ธิชา	อินทร์สอาด	\N	77	23.1	\N	\N	\N	\N	2023-02-17 12:49:39.558137
782	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410054	วนิษชา	แย้มพราหมณ์	\N	46	9.2	20	29.2	\N	\N	2023-02-17 12:31:30.877941
785	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410057	วรารักษ์	ศักดิ์สินสกุล	\N	46	9.2	17	26.2	\N	\N	2023-02-17 12:31:30.881
790	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410070	สุธีย์	มะโนชัย	\N	68	13.6	18	31.6	\N	\N	2023-02-17 12:31:30.884232
795	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410080	อาวัสดา	สุตา	\N	72	14.4	20	34.4	\N	\N	2023-02-17 12:31:30.890634
198	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	651910046	ภัทรภร	สีหะอำไพ	\N	4	5	5	5	19.29	38.29	2023-02-03 17:14:08.405736
207	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	651910063	วุฒิพงศ์	อุ่นจะนำ	\N	5	5	5	5	18.86	38.86	2023-02-03 17:14:08.407619
831	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	620510442	ศิรประภา	กุลมาเมือง	\N	66	19.8	\N	\N	\N	\N	2023-02-17 12:49:39.559004
833	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	630510421	หทัยรัตน์	บรรลือ	\N	69	20.7	\N	\N	\N	\N	2023-02-17 12:49:39.569366
787	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410012	เจนจิรา	คำมั่น	\N	65	13	15	28	\N	\N	2023-02-17 12:31:30.880865
836	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	590410061	เชอรี่	เชอรี่	\N	100	30	\N	\N	\N	\N	2023-02-17 12:49:39.57428
793	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410074	อองตวน	เชออล	\N	65	13	0	13	\N	\N	2023-02-17 12:31:30.88993
199	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	651910048	ภาคิน	กมุท	\N	5	5	5	5	15	35	2023-02-03 17:14:08.405946
208	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	651910067	สินธนา	ฟูเสาร์	\N	5	5	0	5	16.71	31.71	2023-02-03 17:14:08.407834
832	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	630510383	กฤษณะ	คงประกอบ	\N	60	18	\N	\N	\N	\N	2023-02-17 12:49:39.559703
834	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	630510435	พีรวัส	ปัญญา	\N	29	8.7	\N	\N	\N	\N	2023-02-17 12:49:39.571366
789	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410013	ฉันฑวัต	วันดี	\N	76	15.2	17	32.2	\N	\N	2023-02-17 12:31:30.881961
794	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410076	อัญชญิกา	อนากาศ	\N	70	14	20	34	\N	\N	2023-02-17 12:31:30.89038
201	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	651910051	ภูบดี	ขุนมธุรส	\N	5	5	5	5	21.43	41.43	2023-02-03 17:14:08.406362
210	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	651910070	สุดารัตน์	ใจจะนะ	\N	5	5	5	5	20.57	40.57	2023-02-03 17:14:08.408246
835	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	630510384	กัลย์สุดา	ชัยศิริ	\N	49	14.7	\N	\N	\N	\N	2023-02-17 12:49:39.573263
797	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410014	ชนิดา	วงค์ทอง	\N	72	14.4	15	29.4	\N	\N	2023-02-17 12:31:30.890256
205	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	651910060	วณิชญา	สิทธิวงค์	\N	5	5	5	5	24	44	2023-02-03 17:14:08.407199
214	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1675419248219	154104	การอนุรักษ์สิ่งแวดล้อม	01	\N	630510382	อิสมาณี	กะลูแป	\N	5	5	5	5	21	41	2023-02-03 17:14:08.46026
837	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	630510388	ช่อผกา	อ้ายสุข	\N	64	19.2	\N	\N	\N	\N	2023-02-17 12:49:39.573861
798	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410019	เชิดศักดิ์	ดู่อินทร์	\N	57	11.4	20	31.4	\N	\N	2023-02-17 12:31:30.89138
838	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	630510389	ญาณวัฒน์	เงินลำยอง	\N	67	20.1	\N	\N	\N	\N	2023-02-17 12:49:39.574068
799	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410025	ณัฐมน	ลือวัฒนานนท์	\N	77	15.4	20	35.4	\N	\N	2023-02-17 12:31:30.891431
839	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	630510392	ธีระกิต	ทิพย์พรม	\N	79	23.7	\N	\N	\N	\N	2023-02-17 12:49:39.5753
800	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410026	ณัฐวุฒิ	ขันแก้ว	\N	63	12.6	20	32.6	\N	\N	2023-02-17 12:31:30.892371
840	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	630510412	ธนิษฐา	ซื่อตรง	\N	63	18.9	\N	\N	\N	\N	2023-02-17 12:49:39.599471
737	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410018	ชุติมันต์	ดุมดก	\N	37.5	7.5	\N	\N	\N	\N	2023-02-17 12:30:42.620713
738	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410021	ณัฐกานต์	ทุนผลงาม	\N	41.5	8.3	\N	\N	\N	\N	2023-02-17 12:30:42.62755
739	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410022	ณัฐณิชา	สุขวันดี	\N	56.5	11.3	\N	\N	\N	\N	2023-02-17 12:30:42.628789
742	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410023	ณัฐดนัย	ฉิมคล้าย	\N	51	10.2	\N	\N	\N	\N	2023-02-17 12:30:42.634101
747	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410036	ธัญลักษณ์	ดอกงาม	\N	33.5	6.7	\N	\N	\N	\N	2023-02-17 12:30:42.638113
753	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410045	พิมพ์พิศา	สุประดิศสกุล	\N	29	5.8	\N	\N	\N	\N	2023-02-17 12:30:42.643445
759	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410064	ศุภโชค	แย้มฟัก	\N	56	11.2	\N	\N	\N	\N	2023-02-17 12:30:42.649964
768	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	590410061	เชอรี่	เชอรี่	\N	100	18.55	\N	\N	\N	\N	2023-02-17 12:30:42.651899
841	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	630510422	อัมพิกา	เสนาธรรม	\N	25	7.5	\N	\N	\N	\N	2023-02-17 12:49:39.615162
740	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	620510415	ปณิธาน	สวัสดิโกมล	\N	98	19.6	\N	\N	\N	\N	2023-02-17 12:30:42.628088
743	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410028	ดาวนภา	ภู่จีน	\N	28	5.6	\N	\N	\N	\N	2023-02-17 12:30:42.634882
748	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410038	นริศรา	บุญอินเขียว	\N	34	6.8	\N	\N	\N	\N	2023-02-17 12:30:42.638737
754	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410046	พิมพ์วิมล	พรมทา	\N	36	7.2	\N	\N	\N	\N	2023-02-17 12:30:42.645829
761	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410067	สัจจชน	พรหมรักษ์	\N	34	6.8	\N	\N	\N	\N	2023-02-17 12:30:42.650454
842	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676612979422	154330	INTRO TO GIS	01	\N	630510451	สวรรยา	บัวบาน	\N	29	8.7	\N	\N	\N	\N	2023-02-17 12:49:39.616489
741	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410002	กรณ์ธนัตถ์	รามณรงค์	\N	58.5	11.7	\N	\N	\N	\N	2023-02-17 12:30:42.62867
744	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410030	ทักษญาพร	มหาวงค์	\N	24.5	4.9	\N	\N	\N	\N	2023-02-17 12:30:42.635196
749	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410040	นวรัตน์	ฤทธิ์บำรุง	\N	35	7	\N	\N	\N	\N	2023-02-17 12:30:42.638995
755	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410052	รุ่งทิวา	มีมานะ	\N	44	8.8	\N	\N	\N	\N	2023-02-17 12:30:42.646157
763	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410069	สุธินี	รักกุศล	\N	95.5	19.1	\N	\N	\N	\N	2023-02-17 12:30:42.650763
745	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410003	กรวรรณ	ถิ่นพิทยานุรัตน์	\N	32	6.4	\N	\N	\N	\N	2023-02-17 12:30:42.634472
750	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410041	น้ำฟ้า	นาคปาน	\N	34	6.8	\N	\N	\N	\N	2023-02-17 12:30:42.642703
757	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410061	ศรุตา	ปัญญาทา	\N	22	4.4	\N	\N	\N	\N	2023-02-17 12:30:42.649285
765	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410078	อาทิตย์	ตุ้ยแก้ว	\N	58	11.6	\N	\N	\N	\N	2023-02-17 12:30:42.651445
746	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410004	กัญชลิตา	พุทธลก	\N	27	5.4	\N	\N	\N	\N	2023-02-17 12:30:42.635689
751	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410042	ปพิชญา	จันยะมี	\N	59	11.8	\N	\N	\N	\N	2023-02-17 12:30:42.643032
758	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410062	ศิริพัฒน์	รั่วลี	\N	54.5	10.9	\N	\N	\N	\N	2023-02-17 12:30:42.649635
766	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410079	อาทิตยา	ชุ่มเย็น	\N	72	14.4	\N	\N	\N	\N	2023-02-17 12:30:42.651694
752	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410006	กิติกานต์	ฤทธิเพชร์	\N	37	7.4	\N	\N	\N	\N	2023-02-17 12:30:42.642585
760	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410066	สริดา	พิบูลย์	\N	17	3.4	\N	\N	\N	\N	2023-02-17 12:30:42.650205
756	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410008	เกียรติศักดิ์	กันทะจันทร์	\N	70	14	\N	\N	\N	\N	2023-02-17 12:30:42.646432
764	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410077	อัษฎาวุธ	อินทรมา	\N	75	15	\N	\N	\N	\N	2023-02-17 12:30:42.651144
762	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410009	ขวัญชนก	โลมาแจ่ม	\N	28.5	5.7	\N	\N	\N	\N	2023-02-17 12:30:42.649844
767	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410010	คอลิค	เหมแก้ว	\N	73	14.6	\N	\N	\N	\N	2023-02-17 12:30:42.651023
769	ชนิดา	สุวรรณประสิทธิ์	chanida.suwanprasit@cmu.ac.th	a1676611842524	154431	GEOSPATIAL ANALYSIS & APP	02	\N	630410016	ชลธิชา	เขียวจันทร์แสง	\N	52	10.4	\N	\N	\N	\N	2023-02-17 12:30:42.652306
770	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410001	กรชนก	วรรณวงค์	\N	79	15.8	20	35.8	\N	\N	2023-02-17 12:31:30.866357
771	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410029	เดชาวัต	อุดแก้ว	\N	48	9.6	1	10.6	\N	\N	2023-02-17 12:31:30.869788
772	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410031	ธนดล	เชาวน์ประยูร	\N	61	12.2	19	31.2	\N	\N	2023-02-17 12:31:30.87032
774	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410033	ธนัชชา	คำหน่วย	\N	52	10.4	20	30.4	\N	\N	2023-02-17 12:31:30.870754
775	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410035	ธวัชชัย	ศรีไชยวงค์	\N	43	8.6	0	8.6	\N	\N	2023-02-17 12:31:30.871176
777	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410039	นลพรรณ	เสียวกระแส	\N	56	11.2	20	31.2	\N	\N	2023-02-17 12:31:30.872305
780	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410047	มนัสชนก	เฉยภัย	\N	20	4	4	8	\N	\N	2023-02-17 12:31:30.875277
783	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410055	วรรณพร	สามสี	\N	84	16.8	20	36.8	\N	\N	2023-02-17 12:31:30.878243
786	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410065	สยาม	รักนาค	\N	73	14.6	16	30.6	\N	\N	2023-02-17 12:31:30.881291
791	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	630410071	สุภกร	พินิจจันทร์	\N	39	7.8	18	25.8	\N	\N	2023-02-17 12:31:30.884555
796	ศักดิ์ดา	หอมหวล	sakda.homhuan@cmu.ac.th	a1676611890770	154431	เทคนิคและการประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์	01	\N	590410061	เชอรี่	เชอรี่	\N	80	16	20	36	\N	\N	2023-02-17 12:31:30.890874
\.


--
-- TOC entry 2995 (class 0 OID 0)
-- Dependencies: 200
-- Name: score_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.score_id_seq', 842, true);


-- Completed on 2023-02-17 16:08:42

--
-- PostgreSQL database dump complete
--

